#! /usr/bin/env python2
# -*- coding: utf-8 -*-
# файл сборник справочников никаких кастомных обьектов только стандартные типы данных
глоссарий:
	зона аропорта

#набор координат

#диспетчерский пункт
#типы диспетчерских пунктов
0 главный диспетчер хоста выдает информацию о диспетчерах и зонах, ведет диспетчеризацию аварийных ситуаций, максимальный приоритет указаний
1-10 диспетчера аэропортов и отдельностоящих впп
1 главный диспетчер аэропорта выдает информацию о диспетчерах зон аэропорта, ведет диспетчеризацию аварийных ситуаций в зоне аэропорта и/или впп, ведет диспетчерезацию движения во всей зоне при отсутствии вспомогательных диспетчеров
2 вспомогательный
tc_type={0:'information and Emergency',1:'airports main TC', 5:'airports secondary TC', 11:'zone TC', 255:'non TC'}
#имя,тип,порт
mainTC ={'name'='Main', 'type'=0,'port'=5000}
KSC_TC ={'name'='KSC' , 'type'=1,'port'=5001}



#Взлетно Посадочные Полосы
#вспомогательные данные для описания полос
#координаты для описания впп
vppcoord{
KSC_West:{'name'='KSCWest', 'lat'=-0.04855056049336841, 'lng':-74.72449313835466000, 'alt':70.0000000000},
KSC_East:{'name':'KSCEast', 'lat':-0.05025878770915180, 'lng':-74.48951284451766242, 'alt':70.0000000000}
}
#материалы покрытия полос (добавить словать описаний на разных языках)
VPP_cover = dict{0:None,1:'concrete',2:'priming'}
#классы ВПП зависит от покрытия, длинны, ширины, наличия подсветки, угла глиссады, максимальной дальности прямой для глиссады(не расчитывается свыше 50км))
VPP_classes = dict{0:{'name':None,'cover':0,'lighting':False},1:'Long_Beton',2:'avl_beton',3:}
#имя, класс, номер, направление, координаты начала и завершения, диспетчерский пункт подлета/пролета, диспетчерский пункт взлета
KSC9 = dict{'name':'KSC9','vpp_class':1,'number':9,'direction':90.4,'edge1':vppcoord.get('KSC_West'),'edge2':vppcoord.get('KSC_East'),'tc_STAR','tc_SID'}





#проекты самолетов





chisl={
1 :{'int' :1,'str':'First',  'ru_str_f':'Первая'    ,'ru_str_m':'Первый'   ,'Rome':'I'   },
2 :{'int' :2,'str':'Second', 'ru_str_f':'Вторая'    ,'ru_str_m':'Второй'   ,'Rome':'II'  },
3 :{'int' :3,'str':'Third',  'ru_str_f':'Третья'    ,'ru_str_m':'Третий'   ,'Rome':'III' },
4 :{'int' :4,'str':'Fourth', 'ru_str_f':'Четвертая' ,'ru_str_m':'Четвертый','Rome':'IV'  },
5 :{'int' :5,'str':'Fifth',  'ru_str_f':'Пятая'     ,'ru_str_m':'Пятый'    ,'Rome':'V'   },    
6 :{'int' :6,'str':'Sixth',  'ru_str_f':'Шестая'    ,'ru_str_m':'Шестой'   ,'Rome':'VI'  },
7 :{'int' :7,'str':'Seventh','ru_str_f':'Седьмая'   ,'ru_str_m':'Седьмой'  ,'Rome':'VII' },
8 :{'int' :8,'str':'Eighth', 'ru_str_f':'Восьмая'   ,'ru_str_m':'Восьмой'  ,'Rome':'VIII'},
9 :{'int' :9,'str':'Ninth',  'ru_str_f':'Девятая'   ,'ru_str_m':'Девятый'  ,'Rome':'IX'  },
10:{'int':10,'str':'Tenth',  'ru_str_f':'Десятая'   ,'ru_str_m':'Десятый'  ,'Rome':'X'   }
}




